[{"title": "Building Xamarin.Forms Mobile Apps Using XAML", "link": "http://www.allitebooks.com/building-xamarin-forms-mobile-apps-using-xaml/", "author": "Dan Hermes", "description": "Leverage Xamarin.Forms to build iOS and Android apps using a single, cross-platform approach. This book is the XAML companion to the C# guide Xamarin Mobile Application Development. You’ll begin with an overview of Xamarin.Forms, then move on to an in-depth XAML (eXtensible Application Markup Language) primer covering syntax, namespaces,…"}, {"title": "Mastering Grunt", "link": "http://www.allitebooks.com/mastering-grunt/", "author": "Nima Mazloumi", "description": "Grunt.js continues to excel as the build automation tool of choice. Along with its support for many third-party technologies, Grunt is packaged with a clean API for defining tasks. This powerful tool can streamline your workflow by automating the preparation tasks for production, such as compression, compilation, obfuscation,…"}, {"title": "Android 3.0 Application Development Cookbook", "link": "http://www.allitebooks.com/android-3-0-application-development-cookbook/", "author": "Daniel Li", "description": "Android is a mobile operating system that runs on a staggering number of smartphones and tablets. Android offers developers the ability to build extremely rich and innovative applications written using the Java programming language. Among the number of books that have been published on the topic, what’s missing…"}, {"title": "PostgreSQL Replication", "link": "http://www.allitebooks.com/postgresql-replication/", "author": "Merrifield Mew Kyle", "description": "PostgreSQL offers a comprehensive set of replication related features, which can be used to make your database servers more robust and way more scalable. Unleashing the power of PostgreSQL provides the user with countless opportunities and a competitive advantage over other database systems. To make things more powerful,…"}, {"title": "HBase Administration Cookbook", "link": "http://www.allitebooks.com/hbase-administration-cookbook/", "author": "Hans-Jürgen Schönig", "description": "As an Open Source distributed big data store, HBase scales to billions of rows, with millions of columns and sits on top of the clusters of commodity machines. If you are looking for a way to store and access a huge amount of data in real-time, then look…"}, {"title": "Microsoft 365 Business for Admins For Dummies", "link": "http://www.allitebooks.com/microsoft-365-business-for-admins-for-dummies/", "author": "Zoltan Böszörmenyi", "description": "Learn streamlined management and maintenance capabilities for Microsoft 365 Business If you want to make it easy for your teams to work together using the latest productivity solutions with built-in security—while saving thousands of dollars in implementing the solution—you’ve picked the right book. Inside, you’ll gain an understanding…"}, {"title": "Tableau For Dummies", "link": "http://www.allitebooks.com/tableau-for-dummies/", "author": "Yifeng Jiang", "description": "Make your data work for you! Tableau For Dummies brings order to the chaotic world of data. Understanding your data and organizing it into formats and visualizations that make sense to you are crucial to making a real impact on your business with the information that’s already at your…"}, {"title": "Starting Out with Java Early Objects, 5 edition", "link": "http://www.allitebooks.com/starting-out-with-java-early-objects-5-edition/", "author": "Jennifer Reed", "description": "Tony Gaddis’s accessible, step-by-step presentation helps beginning students understand the important details necessary to become skilled programmers at an introductory level. Gaddis motivates the study of both programming skills and the Java programming language by presenting all the details needed to understand the “how” and the “why”—but never…"}, {"title": "Starting Out With App Inventor for Android", "link": "http://www.allitebooks.com/starting-out-with-app-inventor-for-android/", "author": "Molly Monsey", "description": "In Starting Out with App Inventor for Android, Tony Gaddis and Rebecca Halsey teach the fundamentals of programming while simultaneously showing students how to create fun, useful, and imaginative apps. Because App Inventor allows students to create apps and see them running on a phone, programming becomes a…"}, {"title": "StumbleUpon For Dummies", "link": "http://www.allitebooks.com/stumbleupon-for-dummies/", "author": "Paul Sochan", "description": "Discover new and interesting online content based on your interests! StumbleUpon helps you discover new and interesting content on the Internet based on your specific interests. With this helpful For Dummies guide, you will learn to complete a profile that alerts StumbleUpon what topics interest you and assists in making…"}, {"title": "Twitter For Dummies, 2nd Edition", "link": "http://www.allitebooks.com/twitter-for-dummies-2nd-edition/", "author": "Jack Dorsey", "description": "A fully updated guide to the how and why of using Twitter The fastest-growing social network utility sports new features, and they’re all covered in this how-to guide from a leading Twitter marketing consultant. Nearly 20 million people are tweeting on Twitter, and this book shows you how…"}, {"title": "macOS Sierra", "link": "http://www.allitebooks.com/macos-sierra/", "author": "Laura Fitton", "description": "With Sierra, Apple brings never-before-seen features to macOS—like Siri voice control, file sharing across all your iOS devices, picture-in-picture mode for iTunes and Safari, and AI photo search. Once again, David Pogue brings his humor and expertise to the #1 bestselling Mac book. Whether you’re a developer or…"}, {"title": "Surface For Dummies", "link": "http://www.allitebooks.com/surface-for-dummies/", "author": "Leslie Poston", "description": "Clear the surface and make way for the new tablet from Microsoft! As Microsoft’s first foray into the tablet market, the Surface is packed with all the features you’re looking for to stay entertained and get things done wherever you go. Written by bestselling veteran author Andy Rathbone, this full-color, easy-to-understand book…"}, {"title": "Android Tablets For Dummies, 2nd Edition", "link": "http://www.allitebooks.com/android-tablets-for-dummies-2nd-edition/", "author": "Michael E. Gruen", "description": "Make your Android do your bidding with help from bestselling author Dan Gookin Congratulations on your new Android tablet! Whether you’re new to Android or new to tablets altogether, you’re about to experience mobile computing like never before with this fun, full-color guide. Written in the trademark For Dummies style,…"}, {"title": "iPad For Dummies, 7th Edition", "link": "http://www.allitebooks.com/ipad-for-dummies-7th-edition/", "author": "David Pogue", "description": "The fast and easy way to get the most out of your iPad – updated for iPad Air 2 and iPad mini 3! This new edition of iPad For Dummies covers all the latest tips and tricks to getting the most out of your iPad, presented in a straightforward-but-fun language…"}, {"title": "ASP.NET 1.1 Solutions Toolkit", "link": "http://www.allitebooks.com/asp-net-1-1-solutions-toolkit/", "author": "Andy Rathbone", "description": "*Includes 15 controls (programs) covering a wide range of situations; provides both a working coded solution to their problem as well as the thinking behind it *Controls can be ‘cut and pasted’ or used as templates for readers to build their own controls"}, {"title": "Foundations of AOP for J2EE Development", "link": "http://www.allitebooks.com/foundations-of-aop-for-j2ee-development/", "author": "Dan Gookin", "description": "* The concepts of AOP are presented independently of any particular implementation * The book covers all 4 major existing tools for AOP: AspectJ, JBoss AOP, AspectWerkz, JAC * The book covers the implementation of a technical aspect based on the Hibernate object/relational persistence framework, a J2EE application…"}, {"title": "Pro SharePoint 2007 Development Techniques", "link": "http://www.allitebooks.com/pro-sharepoint-2007-development-techniques/", "author": "Bob LeVitus", "description": "A hugely practical and up-to-date work, this book is for developers looking to combine the latest advances in Windows and Microsoft development, such as .NET 2.0, ASP.NET AJAX, InfoPath, and Biztalk, with their SharePoint sites. SharePoint is a hot topic right now, and mixing the intersection of one…"}, {"title": "Beginning Ruby On Rails E-Commerce", "link": "http://www.allitebooks.com/beginning-ruby-on-rails-e-commerce/", "author": "dward C. Baig", "description": "Ruby on Rails is the hottest new open source technology around. It offers developers the opportunity to create fully-featured web applications in double-quick time. Rails and e-commerce are a match made in heaven and Beginning Ruby on Rails E-Commerce is the first book to directly target this market…."}, {"title": "Practical OCaml", "link": "http://www.allitebooks.com/practical-ocaml/", "author": "Daniel Cazzulino", "description": "Objective Caml (OCaml) is an open source programming language that utilizes both functional and object oriented programming. Practical OCaml teaches Objective Caml in a straightforward manner, teaching all the features of this functional programming language by example. You will learn how to utilize OCaml to create a simple…"}]